app/views/users/_user_skill_fields.haml

SELECT `skills`.* FROM `skills`
---
  .field
    = f.association :skill, label: "Choose a skill: ",
      collection: Skill.all