app/views/projects/_project_skill_fields.html.haml

SELECT `skills`.* FROM `skills`
---
  .field
    = f.association :skill, label: "Choose a skill: ",
      collection: Skill.all