app/views/projects/show.html.haml

        %ul{class: "list-group"}
          -project.skills.each do |skill|
---
SELECT `skills`.* FROM `skills` INNER JOIN `project_skills` ON `skills`.`id` = `project_skills`.`skill_id` WHERE `project_skills`.`project_id` = 1