app/controllers/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`receiver_id` = 1
---
  def index
    @messages = Message.where(receiver_id: current_user.id)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
INSERT INTO `user_projects` (`user_id`, `project_id`, `created_at`, `updated_at`) VALUES (1, 2, '2016-01-06 05:10:11', '2016-01-06 05:10:11')
SELECT  `user_projects`.* FROM `user_projects` WHERE `user_projects`.`project_id` = 2 AND `user_projects`.`user_id` = 1  ORDER BY `user_projects`.`id` ASC LIMIT 1
UPDATE `user_projects` SET `status` = 1, `updated_at` = '2016-01-06 05:10:11' WHERE `user_projects`.`id` = 5
INSERT INTO `messages` (`sender_id`, `receiver_id`, `project_id`, `content`, `created_at`, `updated_at`) VALUES (1, 2, 2, 'modulo would like to join X. Do you accept?', '2016-01-06 05:10:11', '2016-01-06 05:10:11')
---
  def new
    @message = Message.new
    @sender = User.find(params[:sender_id])
    @project = Project.find(params[:project_id])
    current_user.projects << @project
    @user_project = UserProject.where(project_id: @project.id, user_id: current_user.id).first
    @user_project.update(status: 1)
    @content = "#{@sender.username} would like to join #{@project.name}. Do you accept?"
    @message.update(sender_id: @sender.id, receiver_id: @project.user.id, project_id: @project.id,
      content: @content)
    @message.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
---
  def destroy
    @user = User.find(params[:sender_id])
    @project = Project.find(params[:project_id])