app/controllers/projects_controller.rb

SELECT `project_categories`.* FROM `project_categories`
---
  def index

    # initially show all project categories
    @categories = ProjectCategory.all

SELECT `projects`.* FROM `projects` WHERE `projects`.`project_category_id` = 1
SELECT  `user_projects`.* FROM `user_projects` WHERE `user_projects`.`user_id` = 2 AND `user_projects`.`project_id` = 1  ORDER BY `user_projects`.`id` ASC LIMIT 1
---
  def show

    # show all projects under the selected project category
    @projects = Project.where(project_category_id: params[:project_category_id])
    if current_user
      @user_projects = UserProject.where(user_id:current_user.id)

SELECT `project_categories`.* FROM `project_categories`
SELECT `skill_categories`.* FROM `skill_categories`
---
  def new
    if !user_signed_in?
      flash.alert = "Users must be signed up to log in"
      redirect_to new_user_session_path
    end
    @project = Project.new
    @categories = ProjectCategory.all
    @skill_categories = SkillCategory.all

INSERT INTO `projects` (`name`, `public_description`, `private_description`, `project_category_id`, `user_id`, `created_at`, `updated_at`) VALUES ('dfadf', 'adfadfsdf', 'sdfgsdfgsdfg', 4, 2, '2016-01-05 02:43:48', '2016-01-05 02:43:48')
SELECT  `user_projects`.* FROM `user_projects` WHERE `user_projects`.`project_id` = 1 AND `user_projects`.`user_id` = 2  ORDER BY `user_projects`.`id` ASC LIMIT 1
UPDATE `user_projects` SET `status` = 2, `updated_at` = '2016-01-05 02:43:48' WHERE `user_projects`.`id` = 1
---
  def create
    @project = Project.new(project_params)
    @project.user_id = current_user.id
    if @project.save
      current_user.projects << @project
      @user_project = UserProject.where(project_id: @project.id, user_id: current_user.id).first
      @user_project.update(status: 2)

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
---
  def edit
    @project = Project.find(params[:id])

SELECT  `projects`.* FROM `projects` WHERE (3) LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 1
---
  def destroy
    @project = Project.find_by(params[:id])
    if params[:joined]
      current_user.projects.delete @project