app/controllers/users_controller.rb

SELECT `skill_categories`.* FROM `skill_categories`
SELECT `projects`.* FROM `projects` INNER JOIN `user_projects` ON `projects`.`id` = `user_projects`.`project_id` WHERE `user_projects`.`user_id` = 1 AND (`projects`.`user_id` != 1)
---
  def index
    @user = current_user
    @projects = @user.projects
    @skills = @user.skills
    @skill_categories = SkillCategory.all
    @hosted_projects = @projects.where(user_id: current_user.id)

DELETE FROM `skills` WHERE `skills`.`id` = 7
SELECT  `skills`.* FROM `skills` INNER JOIN `user_skills` ON `skills`.`id` = `user_skills`.`skill_id` WHERE `user_skills`.`user_id` = 1 AND `skills`.`id` = 7 LIMIT 1
---
  def destroy
    current_user.skills.find(params[:format]).destroy

INSERT INTO `user_skills` (`user_id`, `skill_id`, `created_at`, `updated_at`) VALUES (1, 7, '2015-11-25 05:22:27', '2015-11-25 05:22:27')
SELECT  `skills`.* FROM `skills` WHERE `skills`.`id` = 7 LIMIT 1
---
  def update
    flash[:update] = params[:user][:user_skills_attributes]
    params[:user][:user_skills_attributes].each do |key, value|
      if current_user.skills << Skill.find(value[:skill_id])